zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cz_ca/pic32cz_ca90/pic32cz4010ca90144-pinctrl.h
/*
 * Copyright (c) 2025 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Autogenerated file
 */

#ifndef MICROCHIP_PIC32CZ4010CA90144_PINCTRL_H_
#define MICROCHIP_PIC32CZ4010CA90144_PINCTRL_H_

#include <dt-bindings/pic32c/pic32cz_ca/common/mchp_pinctrl_pinmux_pic32c.h>

/* pa0_gpio */
#define PA0_GPIO MCHP_PINMUX(a, 0, gpio, gpio)

/* pa0a_eic_extint0 */
#define PA0A_EIC_EXTINT0 MCHP_PINMUX(a, 0, a, periph)

/* pa0k_eth_gtx1 */
#define PA0K_ETH_GTX1 MCHP_PINMUX(a, 0, k, periph)

/* pa1_gpio */
#define PA1_GPIO MCHP_PINMUX(a, 1, gpio, gpio)

/* pa1a_eic_extint1 */
#define PA1A_EIC_EXTINT1 MCHP_PINMUX(a, 1, a, periph)

/* pa1k_eth_gtx0 */
#define PA1K_ETH_GTX0 MCHP_PINMUX(a, 1, k, periph)

/* pa2_gpio */
#define PA2_GPIO MCHP_PINMUX(a, 2, gpio, gpio)

/* pa2a_eic_extint2 */
#define PA2A_EIC_EXTINT2 MCHP_PINMUX(a, 2, a, periph)

/* pa2f_tcc2_wo5 */
#define PA2F_TCC2_WO5 MCHP_PINMUX(a, 2, f, periph)

/* pa2k_eth_gtxen */
#define PA2K_ETH_GTXEN MCHP_PINMUX(a, 2, k, periph)

/* pa3_gpio */
#define PA3_GPIO MCHP_PINMUX(a, 3, gpio, gpio)

/* pa3a_eic_extint3 */
#define PA3A_EIC_EXTINT3 MCHP_PINMUX(a, 3, a, periph)

/* pa3d_sercom2_pad3 */
#define PA3D_SERCOM2_PAD3 MCHP_PINMUX(a, 3, d, periph)

/* pa3f_tcc2_wo4 */
#define PA3F_TCC2_WO4 MCHP_PINMUX(a, 3, f, periph)

/* pa3k_eth_gmdc */
#define PA3K_ETH_GMDC MCHP_PINMUX(a, 3, k, periph)

/* pa4_gpio */
#define PA4_GPIO MCHP_PINMUX(a, 4, gpio, gpio)

/* pa4a_eic_extint4 */
#define PA4A_EIC_EXTINT4 MCHP_PINMUX(a, 4, a, periph)

/* pa4d_sercom2_pad2 */
#define PA4D_SERCOM2_PAD2 MCHP_PINMUX(a, 4, d, periph)

/* pa4f_tcc2_wo3 */
#define PA4F_TCC2_WO3 MCHP_PINMUX(a, 4, f, periph)

/* pa4k_eth_gmdio */
#define PA4K_ETH_GMDIO MCHP_PINMUX(a, 4, k, periph)

/* pa5_gpio */
#define PA5_GPIO MCHP_PINMUX(a, 5, gpio, gpio)

/* pa5a_eic_extint4 */
#define PA5A_EIC_EXTINT4 MCHP_PINMUX(a, 5, a, periph)

/* pa5f_tcc3_wo0 */
#define PA5F_TCC3_WO0 MCHP_PINMUX(a, 5, f, periph)

/* pa5k_eth_grxdv */
#define PA5K_ETH_GRXDV MCHP_PINMUX(a, 5, k, periph)

/* pa6_gpio */
#define PA6_GPIO MCHP_PINMUX(a, 6, gpio, gpio)

/* pa6a_eic_extint6 */
#define PA6A_EIC_EXTINT6 MCHP_PINMUX(a, 6, a, periph)

/* pa6f_tcc3_wo1 */
#define PA6F_TCC3_WO1 MCHP_PINMUX(a, 6, f, periph)

/* pa6k_eth_grxer */
#define PA6K_ETH_GRXER MCHP_PINMUX(a, 6, k, periph)

/* pa7_gpio */
#define PA7_GPIO MCHP_PINMUX(a, 7, gpio, gpio)

/* pa7a_eic_extint7 */
#define PA7A_EIC_EXTINT7 MCHP_PINMUX(a, 7, a, periph)

/* pa7b_adc3_ain3 */
#define PA7B_ADC3_AIN3 MCHP_PINMUX(a, 7, b, periph)

/* pa8_gpio */
#define PA8_GPIO MCHP_PINMUX(a, 8, gpio, gpio)

/* pa8a_eic_extint8 */
#define PA8A_EIC_EXTINT8 MCHP_PINMUX(a, 8, a, periph)

/* pa8b_adc3_ain2 */
#define PA8B_ADC3_AIN2 MCHP_PINMUX(a, 8, b, periph)

/* pa9_gpio */
#define PA9_GPIO MCHP_PINMUX(a, 9, gpio, gpio)

/* pa9a_eic_extint9 */
#define PA9A_EIC_EXTINT9 MCHP_PINMUX(a, 9, a, periph)

/* pa9b_adc3_ain1 */
#define PA9B_ADC3_AIN1 MCHP_PINMUX(a, 9, b, periph)

/* pa10_gpio */
#define PA10_GPIO MCHP_PINMUX(a, 10, gpio, gpio)

/* pa10a_eic_extint10 */
#define PA10A_EIC_EXTINT10 MCHP_PINMUX(a, 10, a, periph)

/* pa10b_adc3_ain0 */
#define PA10B_ADC3_AIN0 MCHP_PINMUX(a, 10, b, periph)

/* pa11_gpio */
#define PA11_GPIO MCHP_PINMUX(a, 11, gpio, gpio)

/* pa11a_eic_extint11 */
#define PA11A_EIC_EXTINT11 MCHP_PINMUX(a, 11, a, periph)

/* pa11b_adc2_ain3 */
#define PA11B_ADC2_AIN3 MCHP_PINMUX(a, 11, b, periph)

/* pa12_gpio */
#define PA12_GPIO MCHP_PINMUX(a, 12, gpio, gpio)

/* pa12a_eic_extint12 */
#define PA12A_EIC_EXTINT12 MCHP_PINMUX(a, 12, a, periph)

/* pa12b_adc2_ain2 */
#define PA12B_ADC2_AIN2 MCHP_PINMUX(a, 12, b, periph)

/* pa13_gpio */
#define PA13_GPIO MCHP_PINMUX(a, 13, gpio, gpio)

/* pa13a_eic_extint13 */
#define PA13A_EIC_EXTINT13 MCHP_PINMUX(a, 13, a, periph)

/* pa13b_adc2_ain1 */
#define PA13B_ADC2_AIN1 MCHP_PINMUX(a, 13, b, periph)

/* pa14_gpio */
#define PA14_GPIO MCHP_PINMUX(a, 14, gpio, gpio)

/* pa14a_eic_extint14 */
#define PA14A_EIC_EXTINT14 MCHP_PINMUX(a, 14, a, periph)

/* pa14b_adc2_ain0 */
#define PA14B_ADC2_AIN0 MCHP_PINMUX(a, 14, b, periph)

/* pa15_gpio */
#define PA15_GPIO MCHP_PINMUX(a, 15, gpio, gpio)

/* pa15a_eic_extint15 */
#define PA15A_EIC_EXTINT15 MCHP_PINMUX(a, 15, a, periph)

/* pa15b_adc1_ain3 */
#define PA15B_ADC1_AIN3 MCHP_PINMUX(a, 15, b, periph)

/* pa16_gpio */
#define PA16_GPIO MCHP_PINMUX(a, 16, gpio, gpio)

/* pa16a_eic_extint0 */
#define PA16A_EIC_EXTINT0 MCHP_PINMUX(a, 16, a, periph)

/* pa16b_adc1_ain2 */
#define PA16B_ADC1_AIN2 MCHP_PINMUX(a, 16, b, periph)

/* pa17_gpio */
#define PA17_GPIO MCHP_PINMUX(a, 17, gpio, gpio)

/* pa17a_eic_extint1 */
#define PA17A_EIC_EXTINT1 MCHP_PINMUX(a, 17, a, periph)

/* pa17b_adc1_ain1 */
#define PA17B_ADC1_AIN1 MCHP_PINMUX(a, 17, b, periph)

/* pa18_gpio */
#define PA18_GPIO MCHP_PINMUX(a, 18, gpio, gpio)

/* pa18a_eic_extint2 */
#define PA18A_EIC_EXTINT2 MCHP_PINMUX(a, 18, a, periph)

/* pa18b_adc1_ain0 */
#define PA18B_ADC1_AIN0 MCHP_PINMUX(a, 18, b, periph)

/* pa19_gpio */
#define PA19_GPIO MCHP_PINMUX(a, 19, gpio, gpio)

/* pa19a_eic_extint3 */
#define PA19A_EIC_EXTINT3 MCHP_PINMUX(a, 19, a, periph)

/* pa19b_ac_ain3 */
#define PA19B_AC_AIN3 MCHP_PINMUX(a, 19, b, periph)

/* pa19b_adc0_ain5 */
#define PA19B_ADC0_AIN5 MCHP_PINMUX(a, 19, b, periph)

/* pa20_gpio */
#define PA20_GPIO MCHP_PINMUX(a, 20, gpio, gpio)

/* pa20a_eic_extint4 */
#define PA20A_EIC_EXTINT4 MCHP_PINMUX(a, 20, a, periph)

/* pa20b_ac_ain2 */
#define PA20B_AC_AIN2 MCHP_PINMUX(a, 20, b, periph)

/* pa20b_adc0_ain4 */
#define PA20B_ADC0_AIN4 MCHP_PINMUX(a, 20, b, periph)

/* pa21_gpio */
#define PA21_GPIO MCHP_PINMUX(a, 21, gpio, gpio)

/* pa21a_eic_extint5 */
#define PA21A_EIC_EXTINT5 MCHP_PINMUX(a, 21, a, periph)

/* pa21f_tcc8_wo0 */
#define PA21F_TCC8_WO0 MCHP_PINMUX(a, 21, f, periph)

/* pa21k_eth_txck */
#define PA21K_ETH_TXCK MCHP_PINMUX(a, 21, k, periph)

/* pa22_gpio */
#define PA22_GPIO MCHP_PINMUX(a, 22, gpio, gpio)

/* pa22a_eic_extint6 */
#define PA22A_EIC_EXTINT6 MCHP_PINMUX(a, 22, a, periph)

/* pa22f_tcc7_wo0 */
#define PA22F_TCC7_WO0 MCHP_PINMUX(a, 22, f, periph)

/* pa22k_eth_tsucomp */
#define PA22K_ETH_TSUCOMP MCHP_PINMUX(a, 22, k, periph)

